Repository: pypi-data/pypi-mirror-304
Catalog: packages/csb43/csb43-0.10.1-py3-none-any.whl/csb43/i18n/*/LC_MESSAGES/messages.po
Languages: es

source: direct debit
es: adeudo

source: transfer
es: transferencia

source: Package 'tablib' not found. Formats provided by 'tablib' will not be available.
es: Paquete 'tablib' no encontrado. Los formatos provistos por 'tablib' no estarán disponibles.

source: Package 'yaml' not found. Hierarchical YAML format will not be available.
es: Paquete 'yaml' no encontrado. El formato YAML jerárquico no estará disponible.

source: unexpected format {format}
es: no se esperaba el formato {format}

source: Accounts
es: Cuentas

source: Transactions
es: Movimientos

source: unexpected format %s
es: no se esperaba el formato %s

source: ({alt}) mismatch in summary ({ref})
es: {alt}) discordancia en resumen ({ref})

source: adding records to a closed account
es: intentando cerrar una cuenta ya cerrada

source: unknown or illegal record: {record}
es: registro ilegal o desconocido: {record}

source: + Account: {account_number} {short_name}
es: + Cuenta: {account_number} {short_name}

source: From:||{date_from}
es: Desde:||{date_from}

source: To:||{date_to}
es: Hasta:||{date_to}

source: {ntransactions:d} transaction(s) read
es: {ntransactions:d} movimiento(s) leído(s)

source: Account properly closed: {ac_is_closed}
es: Cuenta cerrada adecuadamente: {ac_is_closed}

source: Information mode: {information_mode}
es: Modalidad de información: {information_mode}

source: Previous amount:||{ib_amount:14.2f} {ib_currency}
es: Montante previo:||{ib_amount:14.2f} {ib_currency}

source: Income:||{inc_amount:14.2f} {inc_currency}
es: Haber:||{inc_amount:14.2f} {inc_currency}

source: Expense:||{exp_amount:14.2f} {exp_currency}
es: Debe:||{exp_amount:14.2f} {exp_currency}

source: total_records
es: total_registros

source: incongruent closing record of file: total records {alt:d} != {ref:d}
es: registro de cierre de fichero incongruente: total de registros {alt:d} != {ref:d}

source: adding records to a closed batch
es: intentando cerrar un lote ya cerrado

source: unknown or illegal record: {}
es: registro ilegal o desconocido: {}

source: Encoding: {encoding:s}
es: Codificación: {encoding:s}

source: File properly closed: {file_is_closed}
es: Fichero cerrado adecuadamente: {file_is_closed}

source: Accounts read:||{naccounts:>5d}
es: Cuentas leídas:||{naccounts:>5d}

source: Records read:||{total_records:>5d}
es: Registro leídos:||{total_records:>5d}

source: Unknown scheme code for SEPA direct debit: '%s'
es: Código de esquema desconocido para adeudos SEPA: '%s'

source: padding1
es: relleno1

source: padding2
es: relleno2

source: remitance_information_cont
es: cont_concepto

source: padding4
es: relleno4

source: Validation failed for reference '{ref}'. Unexpected control digit.
es: Validación fallida para la referencia '{ref}'. Dígito de control no esperado.

source: the appended optional item already exists
es: el concepto adicional añadido ya existe

source: a SEPA transfer exists
es: existe una transferencia SEPA

source: a SEPA debit exists
es: existe un adeudo SEPA

source: there can only be {max_items:d} optional items
es: sólo puede haber {max_items:d} conceptos adicionales

source: `record_code` should be {next:d} but found {code:d}. The wrong value will be fixed
es: `record_code` debería ser {next:d} pero se ha encontrado {code:d}. El valor erróneo será corregido

source: trying to set a SEPA transfer while the transaction contains some standard optional items
es: intentando asignar una transferencia SEPA mientras existen conceptos adicionales en la transacción

source: trying to set a SEPA transfer while the transaction contains a SEPA Direct Debit record set
es: intentando asignar una transferencia SEPA conteniendo la transacción una colección de registros de adeudo SEPA.

source: trying to set a SEPA transfer while the transaction contains a SEPA Transfer record set
es: intentando asignar una transferencia SEPA conteniendo la transacción una colección de registros de transferencia SEPA.

source: SEPA mode is disabled
es: el modo SEPA no está activo

source: adding another exchange record will replace the existing record
es: al añadir otro registro de equivalencia de importe se reemplazará el registro existente

source: unable to convert value to internal representation format: {exc}
es: no se ha podido convertir el valor al formato de representación interna: {exc}

source: invalid date format: {value}
es: formato de fecha inválido: {value}

source: Bad format: content {content!r} mismatches the expected format {value} for this field
es: mal formato: el contenido {content!r} no concuerda con el formato esperado {value} para este campo

source: non-negative values are not allowed
es: no se permiten valores no negativos

source: unexpected type
es: tipo inesperado

source: 'None' value is not allowed
es: no se permite el valor 'None'

source: non compliant {size:d}-sized record has been right-padded with {pad:d} spaces
es: el registro disconforme de tamaño {size:d} se ha rellenado con {pad:d} espacios a la derecha

source: non compliant {size:d}-sized record has been right-truncated in order to match the required size ({required:d} bytes)
es: el registro disconforme de tamaño {size:d} se ha truncado por la derecha para coincidir con el tamaño requerido ({required:d} bytes)

source: a {size:d}-sized bytes record is required
es: se requiere un registro de {size:d} bytes de longitud

source: wrong field size: {valid_size:d} != {size:d} ({value})
es: longitud de campo incorrecta: {valid_size:d} != {size:d} ({value})

source: Bad format: content {content!r} mismatches the expected format r{pattern!r} for this field
es: mal formato: el contenido {content!r} no concuerda con el formato esperado r{pattern!r} para este campo

source: Encoding {encoding} is not compatible with the AEB43 field padding character.
es: La codificación {encoding} no es compatible con el carácter de relleno de campo de AEB43.

source: trying to close an already closed account
es: intentando cerrar una cuenta ya cerrada

source: balance (%1.2f) mismatch in closing account record (%1.2f)
es: el balance (%1.2f) no concuerda con el del registro de cierre de cuenta (%1.2f)

source: income amount (%1.2f) mismatch in closing account record (%1.2f)
es: el montante en el haber (%1.2f) no concuerda con el del registro de cierre de cuenta (%1.2f)

source: expense amount (%1.2f) mismatch in closing account record (%1.2f)
es: el montante en el debe (%1.2f) no concuerda con el del registro de cierre de cuenta (%1.2f)

source: income entries (%d) mismatch in closing account record (%d)
es: el número de entradas en el haber (%d) no concuerda con el del registro de cierre de cuenta (%d)

source: expense entries (%d) mismatch in closing account record (%d)
es: el número de entradas en el haber (%d) no concuerda con el del registro de cierre de cuenta (%d)

source: transactions
es: movimientos

source: trying to close an already closed file
es: intentando cerrar un fichero ya cerrado

source: incongruent closing record of file: total records %d != %d
es: registro de cierre de fichero incongruente: total de registros %d != %d

source: accounts
es: cuentas

source: {naccounts:d} account(s) read
es: {naccounts:d} cuenta(s) leída(s)

source: File properly closed: {file_is_closed}
es: Fichero cerrado adecuadamente: {file_is_closed}

source: {total_records:d} record(s) read
es: {total_records:d} registro(s) leído(s)

source: + Account: {account_number} {short_name}
es: + Cuenta; {account_number} {short_name}

source: From: {date_from}
es: Desde: {date_from}

source: To: {date_to}
es: Hasta: {date_to}

source: Account properly closed: {ac_is_closed}
es: Cuenta cerrada adecuadamente: {ac_is_closed}

source: Information mode: {information_mode}
es: Modalidad de información: {information_mode}

source: Previous amount: {ib_amount:14.2f} {ib_currency}
es: Montante previo: {ib_amount:14.2f} {ib_currency}

source: Income: {inc_amount:14.2f} {inc_currency}
es: Haber: {inc_amount:14.2f} {inc_currency}

source: Expense: {exp_amount:14.2f} {exp_currency}
es: Debe: {exp_amount:14.2f} {exp_currency}

source: Encoding %s is not compatible with the AEB43 field padding character.
es: La codificación %s no es compatible con el carácter de relleno de campo de AEB43.

source: maximum number of exchange record reached (%s)
es: número máximo de registro de cambio de divisas alcanzado (%s)

source: Validation failed for reference '%s'
es: Validación fallida para el campo de referencia '%s'

source: the maximum number of complementary items for transaction has been reached: %d
es: número máximo de conceptos adicionales por movimiento alcanzado: %d

source: bad format, 6 fields expected, but{n_fields:d} found
es: mal formato, se esperaban 6 campos, pero se encontraron {n_fields:d}

source: datetime.date expected
es: se esperaba datetime.date

source: instance of datetime or date expected, but {val!r} found
es: se esperaba una instancia de datetime o de date, pero se encontró {val!r}

source: Convert a CSB43 file to another format
es: Convierte un fichero CSB43 a otro formato

source: a csb43 file ('-' for stdin)
es: un fichero csb43 ('-' para stdin)

source: strict mode
es: modo estricto

source: do not convert items to SEPA transfers or direct debits
es: no convertir conceptos adicionales a transferencias o adeudos SEPA

source: use DDMMYY as date format while parsing the csb43 file instead of YYMMDD
es: usar DDMMYY como formato de fecha al parsear el fichero csb43 en lugar de YYMMDD

source: set the number of decimal places for the money amount type
es: establece el número de posiciones decimales para el tipo monetario

source: set the input encoding ('cp850' for standard AEB file)
es: establece la codificación de entrada ('cp850' para ficheros AEB estándar)

source: export monetary amounts using binary floating point numbers as a fallback
es: exporta importes monetarios usando números de punto flotante como último recurso

source: show csb43 warnings
es: muestra advertencias de csb43

source: destination file ('-' for stdout)
es: fichero de destino ('-' para stdout)

source: format of the output file
es: formato del fichero de salida

source: set the output encoding
es: establece la codificación de salida

source: * File: {name}
es: * Fichero: {name}

source: stdout not supported for binary formats
es: stdout no está soportado en formatos binarios

source: bad code of record or unexpected length: >>>%s<<<
es: código malo de registro o longitud inesperada: >>>%s<<<

source: incompatible object '{found!r}', type(s) {expected} expected
es: objeto incompatible '{found!r}', se esperaban tipo(s) {expected}

source: pycountry.Currencies object or a valid ISO 4217 code expected, but {obj!r} found
es: se esperaba un objecto pycountry.Currencies o un código válido ISO 4217, pero se encontró {obj!r}

source: padding
es: relleno

source: bank_code
es: codigo_entidad

source: branch_code
es: codigo_sucursal

source: account_key
es: clave_de_cuenta

source: account_number
es: numero_de_cuenta

source: information_mode
es: modalidad_de_informacion

source: short_name
es: nombre_abreviado

source: currency
es: divisa

source: initial_date
es: fecha_inicial

source: final_date
es: fecha_final

source: initial_balance
es: saldo_inicial

source: final_balance
es: saldo_final

source: income
es: importes_haber

source: expenses
es: importes_debe

source: income_entries
es: apuntes_en_haber

source: expenses_entries
es: apuntes_en_debe

source: summary
es: resumen

source: document_number
es: numero_documento

source: shared_item
es: concepto_comun

source: own_item
es: concepto_propio

source: item1
es: concepto_adicional1

source: item2
es: concepto_adicional2

source: reference1
es: referencia1

source: reference2
es: referencia2

source: transaction_date
es: fecha_de_movimiento

source: value_date
es: fecha_valor

source: amount
es: importe

source: original_currency
es: divisa_original

source: original_amount
es: importe_original

source: optional_items
es: conceptos_adicionales

source: exchange
es: equivalencia de importe

source: sepa_debit
es: adeudo_sepa

source: sepa_transfer
es: transferencia_sepa

source: record_code
es: codigo_registro

source: scheme_code
es: codigo_esquema

source: creditor_name
es: nombre_acreedor

source: creditor_id
es: id_acreedor

source: mandate_reference
es: referencia_mandato

source: purpose
es: proposito

source: purpose_category
es: categoria_del_proposito

source: remitance_information
es: concepto

source: creditor_reference
es: referencia_acreedor

source: debtor_name
es: nombre_deudor

source: originator_name
es: nombre_ordenante

source: originator_code
es: codigo_ordenante

source: originator_reference
es: referencia_ordenante

source: originator_reference_party
es: nombre_por_cuenta_de

source: additional_info
es: info_adicional
